// Структура Трансэнерго Московской дирекции по энергообеспечению
const rzdStructure = {
    "Трансэнерго": {
        "Орган управления": {
            "Служба по работе на оптовом и розничных рынках электроэнергии": [
                "Отдел по работе на оптовом рынке электроэнергии",
                "Отдел по работе на розничных рынках электроэнергии"
            ],
            "Служба заказчика": [
                "Отдел инвестиций",
                "Отдел капитального ремонта"
            ],
            "Служба управления трудовыми ресурсами и организационной структурой": [
                "Отдел организационного развития и штатной работы",
                "Отдел организации, оплаты и мотивации труда"
            ],
            "Служба управления персоналом": [
                "Отдел развития и профессионального обучения",
                "Отдел реализации кадровой политики",
                "Сектор социального развития, соревнований и наград"
            ],
            "Технический отдел": [
                "Отдел по развитию высокоскоростного движения",
                "Отдел электроэнергетики",
                "Отдел тяговых подстанций и технологических сетей",
                "Отдел технологических присоединений и работы с потребителями",
                "Оперативно-диспетчерская группа",
                "Отдел эксплуатации контактной сети",
                "Отдел тарифного регулирования",
                "Отдел эксплуатации устройств учета электроэнергии и метрологии",
                "Отдел развития скоростного и тяжеловесного движения"
            ],
            "Отдел конкурсных процедур": [],
            "Отдел по организации безопасности движения": [],
            "Отдел комплексных проектов": [],
            "Отдел экономики": [],
            "Отдел финансов": [],
            "Юридический отдел": [],
            "Административно-хозяйственный отдел": [],
            "Отдел по безопасности": [],
            "Отдел механизации": [],
            "Отдел охраны труда, промышленной безопасности и экологического контроля": [],
            "Отдел координации поставок материально-технических ресурсов": [],
            "Отдел документационного обеспечения": [],
            "Сектор информатизации": [],
            "Группа информационного обеспечения": [],
            "Группа по взаимодействию подразделений электроснабжения": []
        },
        "Московская дирекция по энергообеспечению": {
            "Орган управления МОСК ДЭ": {
                "Служба заказчика": [
                    "Отдел подготовки строительства",
                    "Производственный отдел",
                    "Технический отдел",
                    "Сектор эксплуатации устройств учета и метрологии",
                    "Отдел планирования капитального ремонта и реконструкции",
                    "Отдел по эксплуатации",
                    "Сектор материально-технических ресурсов",
                    "Оперативно-диспетчерская группа",
                    "Отдел тяговых подстанций",
                    "Отдел по электросетевой деятельности",
                    "Сектор тарифного регулирования",
                    "Отдел экономики",
                    "Сектор финансов",
                    "Отдел покупки и распределения электрической энергии",
                    "Сектор управления персоналом",
                    "Сектор управления трудовыми ресурсами",
                    "Сектор механизации"
                ]
            },
            "Московский линейный отдел": [
                "Группа \"Москва-восток\"",
                "Группа \"Москва-запад и вокзалы\"",
                "Группа \"Москва-север\"",
                "Группа \"Москва-юг\""
            ],
            "Рязанский линейный отдел": [],
            "Тульский линейный отдел": [
                "г. Новомосковск"
            ],
            "Орловско-Курский линейный отдел": [
                "Орловский линейный сектор"
            ],
            "Смоленский линейный отдел": [
                "г. Вязьма"
            ],
            "Калужско-Брянский линейный отдел": [
                "Брянский линейный сектор"
            ]
        },
        "Московско-Курская дистанция электроснабжения (I группа)": {
            "Производственно-технический отдел": [],
            "Районы контактной сети": [
                "Люблинский район контактной сети",
                "Дежурный пункт контактной сети Люблино",
                "Московский район контактной сети",
                "Дежурный пункт контактной сети Каланчевская",
                "Подольский район контактной сети",
                "Дежурный пункт контактной сети Щербинка",
                "Серпуховской район контактной сети",
                "Столбовской район контактной сети",
                "Царицынский район контактной сети",
                "Дежурный пункт контактной сети Красный Строитель"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Рогожская, Каланчевская, Перерва",
                "Группа тяговых подстанций Столбовая, Чехов, Серпухов",
                "Группа тяговых подстанций Царицыно, Щербинка, Подольск"
            ],
            "Районы электроснабжения": [
                "Московский район электроснабжения",
                "Столбовской район электроснабжения"
            ],
            "Ремонтно-ревизионный участок": []
        },
        "Железнодорожная дистанция электроснабжения (I группа)": {
            "Производственно-технический отдел": [],
            "Районы контактной сети": [
                "Район контактной сети Реутово",
                "Дежурный пункт контактной сети Кусково",
                "Район контактной сети Железнодорожная",
                "Район контактной сети Фрязево",
                "Район контактной сети Орехово-Зуево",
                "Район контактной сети Орехово-Зуево (Восточное)",
                "Район контактной сети Петушки",
                "Район контактной сети Киржач"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Дрезна, Усад",
                "Группа тяговых подстанций Орехово-Восточное, Поточино",
                "Группа тяговых подстанций Салтыковская, Электроугли",
                "Группа тяговых подстанций Санино, Киржач",
                "Группа тяговых подстанций Фрязево, Кашино",
                "Группа тяговых подстанций Реутово, Кусково (МЦД-4)"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Кусково",
                "Район электроснабжения Орехово-Зуево"
            ],
            "Ремонтно-ревизионный участок": []
        },
        "Панковская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Алпатьевский район контактной сети",
                "Бронницкий район контактной сети",
                "Быковский район контактной сети",
                "Воскресенский район контактной сети",
                "Голутвинский район контактной сети",
                "Московский район контактной сети",
                "Панковский район контактной сети",
                "Район контактной сети Москва-Сортировочная"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Вешняки, Панки (МЦД-3)",
                "Группа тяговых подстанций Воскресенск, Непецино",
                "Группа тяговых подстанций Луховицы, Алпатьево",
                "Группа тяговых подстанций Митьково, Яуза (МЦД-3)",
                "Группа тяговых подстанций Отдых, Бронницы, Виноградово",
                "Группа тяговых подстанций Пески, Голутвин"
            ],
            "Районы электроснабжения": [
                "Воскресенский район электроснабжения",
                "Голутвинский район электроснабжения",
                "Люберецкий район электроснабжения",
                "Московский район электроснабжения"
            ]
        },
        "Мытищинская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Александровский район контактной сети",
                "Бужаниновский район контактной сети",
                "Московский район контактной сети",
                "Мытищинский район контактной сети",
                "Пушкинский район контактной сети",
                "Сергиево-Посадский район контактной сети",
                "Щелковский район контактной сети"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Бужаниново, Александров, Бельково",
                "Группа тяговых подстанций Сергиев Посад, Пушкино, Софрино",
                "Группа тяговых подстанций Москва-Пассажирская-Ярославская, Лосиноостровская",
                "Группа тяговых подстанций Мытищи, Щелково, Ивантеевка"
            ],
            "Районы электроснабжения": [
                "Александровский район электроснабжения",
                "Московский район электроснабжения",
                "Мытищинский район электроснабжения",
                "Сергиево-Посадский район электроснабжения"
            ]
        },
        "Лобненская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Бескудниково",
                "Район контактной сети Катуар",
                "Район контактной сети Дмитров",
                "Район контактной сети Вербилки",
                "Район контактной сети Талдом",
                "Район контактной сети Желтиково"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Вербилки, Темпы",
                "Группа тяговых подстанций Желтиково, Драчево",
                "Группа тяговых подстанций Лобня, Марк",
                "Группа тяговых подстанций Талдом, Савелово",
                "Группа тяговых подстанций Трудовая, Дмитров",
                "Тяговая подстанция Москва-Бутырская"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Москва-Бутырская",
                "Район электроснабжения Дмитров"
            ]
        },
        "Покровско-Стрешневская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Покровское-Стрешнево",
                "Район контактной сети Нахабино",
                "Район контактной сети Румянцево",
                "Район контактной сети Волоколамск",
                "Район контактной сети Манихино I",
                "Район контактной сети Поварово II"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Покровское-Стрешнево, Опалиха",
                "Группа тяговых подстанций Румянцево, Чеховская",
                "Группа тяговых подстанций Чисмена, Волоколамск, Шаховская",
                "Группа тяговых подстанций Поварово, Жилино",
                "Группа тяговых подстанций Манихино, Дюдьково"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Подмосковная",
                "Район электроснабжения Волоколамск",
                "Район электроснабжения Манихино"
            ]
        },
        "Московско-Смоленская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Москва-Пассажирская-Смоленская",
                "Район контактной сети Одинцово",
                "Район контактной сети Голицыно",
                "Район контактной сети Тучково",
                "Район контактной сети Можайск",
                "Район контактной сети Кубинка"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Фили, Славянская, Одинцово",
                "Группа тяговых подстанций Голицыно, Кубинка",
                "Группа тяговых подстанций Тучково, Можайск",
                "Тяговая подстанция Беговая (МЦД-4)"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Можайск",
                "Район электроснабжения Москва-Пассажирская-Смоленская"
            ]
        },
        "Внуковская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Москва-Киевская",
                "Район контактной сети Очаково",
                "Район контактной сети Апрелевка",
                "Район контактной сети Нара",
                "Район контактной сети Малоярославец",
                "Район контактной сети Кресты",
                "Район контактной сети Бекасово",
                "Район контактной сети Суходрев",
                "Район контактной сети Муратовка",
                "Район контактной сети Калуга",
                "Район контактной сети Бабынино"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Апрелевка, Внуково",
                "Группа тяговых подстанций Балабаново, Малоярославец",
                "Группа тяговых подстанций Бекасово, Кресты",
                "Группа тяговых подстанций Москва, Очаково",
                "Группа тяговых подстанций Нара, Обнинское",
                "Тяговая подстанция Бабынино",
                "Тяговая подстанция Воротынск",
                "Тяговая подстанция Кудринская",
                "Тяговая подстанция Солнечная (МЦД-4)",
                "Тяговая подстанция Суходрев",
                "Тяговая подстанция Тихонова Пустынь"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Бекасово-Сортировочное",
                "Район электроснабжения Калуга I",
                "Район электроснабжения Москва-Киевская",
                "Район электроснабжения Нара"
            ]
        },
        "Тульская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Тарусская",
                "Район контактной сети Ревякино",
                "Район контактной сети Тула",
                "Район контактной сети Щекино",
                "Район контактной сети Плавск",
                "Район контактной сети Скуратово",
                "Район контактной сети Новомосковск"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Лазарево, Плавск, Скуратово",
                "Группа тяговых подстанций Тарусская, Шульгино, Ревякино",
                "Группа тяговых подстанций Тула, Щекино",
                "Группа тяговых подстанций Урванка, Северная"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Венев",
                "Район электроснабжения Ефремов",
                "Район электроснабжения Новомосковск",
                "Район электроснабжения Плеханово",
                "Район электроснабжения Ряжск",
                "Район электроснабжения Тула",
                "Район электроснабжения Узловая",
                "Район электроснабжения Черепеть, Белев"
            ]
        },
        "Орловская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Чернь",
                "Район контактной сети Отрада",
                "Район контактной сети Орел",
                "Район контактной сети Становой Колодезь",
                "Район контактной сети Глазуновка"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Становой Колодезь, Змиевка, Глазуновка",
                "Группа тяговых подстанций Чернь, Мценск, Отрада, Орел"
            ],
            "Районы электроснабжения": [
                "Орловский район электроснабжения",
                "Верховский район электроснабжения"
            ]
        },
        "Курская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Курск",
                "Район контактной сети Возы",
                "Район контактной сети Поныри"
            ],
            "Тяговые подстанции": [
                "Тяговая подстанция Курск",
                "Тяговая подстанция Свобода",
                "Тяговая подстанция Возы",
                "Тяговая подстанция Поныри"
            ],
            "Районы электроснабжения": [
                "Курский район электроснабжения",
                "Льговский район электроснабжения",
                "Курбакинский район электроснабжения"
            ]
        },
        "Московско-Павелецкая дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Москва",
                "Район контактной сети Домодедово",
                "Район контактной сети Барыбино",
                "Район контактной сети Михнево",
                "Район контактной сети Яганово",
                "Район контактной сети Жилево",
                "Район контактной сети Лихоборы (МЦК)",
                "Район контактной сети Андроновка (МЦК)"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Окружная, Расторгуево",
                "Группа тяговых подстанций Домодедово, Барыбино, Повадино",
                "Группа тяговых подстанций Михнево, Яганово, Жилево",
                "Группа тяговых подстанций Белокаменная, Андроновка (МЦК)"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Бирюлево",
                "Район электроснабжения Лихоборы (МЦК)",
                "Район электроснабжения Михнево"
            ]
        },
        "Ожерельевская дистанция электроснабжения (II группа)": {
            "Районы контактной сети": [
                "Ожерельевский район контактной сети",
                "Узуновский район контактной сети",
                "Макеевский район контактной сети",
                "Михайловский район контактной сети",
                "Павелецкий район контактной сети"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Виленки, Мшанка",
                "Группа тяговых подстанций Степная, Макеево",
                "Группа тяговых подстанций Ступино, Ожерелье",
                "Группа тяговых подстанций Узуново, Богатищево"
            ]
        },
        "Рязанская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Рыбное",
                "Район контактной сети Рязань",
                "Район контактной сети Листвянка",
                "Район контактной сети Денежниково",
                "Район контактной сети Чемодановка",
                "Район контактной сети Ряжск",
                "Район контактной сети Перевлес",
                "Район контактной сети Шилово",
                "Район контактной сети Назаровка",
                "Район контактной сети Сасово"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Рыбное, Истодники",
                "Тяговая подстанция Лесок",
                "Группа тяговых подстанций Листвянка, Перевлес",
                "Тяговая подстанция Шелухово",
                "Тяговая подстанция Шилово",
                "Группа тяговых подстанций Назаровка, Нижне-Мальцево",
                "Группа тяговых подстанций Сасово, Кустаревка",
                "Группа тяговых подстанций Денежниково, Чемодановка",
                "Тяговая подстанция Ряжск",
                "Тяговая подстанция Житово"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Рыбное",
                "Район электроснабжения Рязань",
                "Район электроснабжения Шилово",
                "Район электроснабжения Сасово",
                "Район электроснабжения Ряжск",
                "Район электроснабжения Скопин"
            ]
        },
        "Люберецкая дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Куровская",
                "Район контактной сети Гжель",
                "Район контактной сети Черусти",
                "Район контактной сети Берендино",
                "Район контактной сети Шатура"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Анциферово, Запутная",
                "Группа тяговых подстанций Кривандино, Черусти",
                "Группа тяговых подстанций Куровская, Берендино, Егорьевск",
                "Группа тяговых подстанций Овражки, Гжель"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Куровская",
                "Район электроснабжения Черусти"
            ]
        },
        "Смоленская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Район контактной сети Милохово",
                "Район контактной сети Кардымово",
                "Район контактной сети Смоленск",
                "Район контактной сети Ракитная",
                "Район контактной сети Гусино"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения Рославль",
                "Район электроснабжения Смоленск"
            ]
        },
        "Брянская дистанция электроснабжения (I группа)": {
            "Районы контактной сети": [
                "Сухиничский район контактной сети",
                "Паликский район контактной сети",
                "Березовский район контактной сети",
                "Брянск-Льговский район контактной сети",
                "Брянск-Орловский район контактной сети",
                "Навлинский район контактной сети",
                "Суземский район контактной сети",
                "Жуковский район контактной сети"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций Брянск-Восточный, Жуковка, Березовский",
                "Группа тяговых подстанций Навля, Холмечи",
                "Группа тяговых подстанций Сухиничи, Палики"
            ],
            "Районы электроснабжения": [
                "Брянск-Льговский район электроснабжения",
                "Брянск-Орловский район электроснабжения",
                "Навлинский район электроснабжения",
                "Унечский район электроснабжения",
                "Новозыбковский район электроснабжения",
                "Сухиничский район электроснабжения"
            ]
        },
        "Вяземская дистанция электроснабжения": {
            "Районы контактной сети": [
                "Район контактной сети станции Гагарин",
                "Район контактной сети станции Вязьма линейная",
                "Район контактной сети станции Вязьма узловая",
                "Район контактной сети станции Издешково"
            ],
            "Тяговые подстанции": [
                "Группа тяговых подстанций станций Колочь, Дровнино",
                "Группа тяговых подстанций станций Гагарин, Серго-Ивановская, Мещерская",
                "Группа тяговых подстанций станций Вязьма, Издешково"
            ],
            "Районы электроснабжения": [
                "Район электроснабжения станции Вязьма",
                "Район электроснабжения станции Фаянсовая"
            ]
        },
        "Технический центр электрификации и электроснабжения": {
            "Отдел контактной сети": [
                "Группа внедрения и приемки",
                "Группа коррозии"
            ],
            "Отдел эксплуатации тяговых подстанций и энергетики": [
                "Группа автоблокировки и энергетики",
                "Группа высоковольтных испытаний",
                "Группа защит",
                "Группа масляного хозяйства",
                "Группа по быстродействующим выключателям и преобразовательным агрегатам",
                "Группа по замерам токов и проведению тепловизионного контроля",
                "Группа по расчетам пропускной способности",
                "Группа по телемеханике и автоматизированным системам управления"
            ],
            "Технический отдел": [],
            "Отдел мониторинга": [],
            "Отдел оперативно-диспетчерского управления": [],
            "Вагон-электротехническая лаборатория": [],
            "Вагоны-лаборатории контактной сети": [],
            "Сектор координации строительных работ": [
                "Участок сопровождения проектно-изыскательных работ",
                "Участок сопровождения строительно-монтажных работ"
            ],
            "Отдел комплектации поставок и оборудования": [],
            "Отдел подготовки строительства": [],
            "Отдел договорной работы": [],
            "Отдел экспертизы проектов и смет": [],
            "Производственно-технический отдел": [],
            "Планово-экономический отдел": [],
            "Отдел по сопровождению проектов": [],
            "Сектор планирования и сопровождения \"окон\"": []
        }
        },
    "Центральная дирекция по ремонту пути": {
        "Орган управления": {
            "Производственная служба": [
                "Группа информационного обеспечения",
                "Отдел планирования ремонта",
                "Производственный отдел"
            ],
            "Техническая служба": [
                "Отдел разработки и внедрения новых проектов",
                "Сектор администрирования, эксплуатации и технологического сопровождения систем управления",
                "Технический отдел"
            ],
            "Служба механизации": [
                "Отдел эксплуатации путевой техники и вагонов",
                "Отдел ремонта путевой техники, оборудования и вагонов"
            ],
            "Служба экономики": [
                "Отдел планирования, бюджетирования и анализа производственно-хозяйственной деятельности",
                "Отдел статистического учета, ценообразования, калькулирования и экономических расчетов"
            ],
            "Служба финансов": [
                "Отдел платежных балансов",
                "Отдел финансового контроллинга и прогнозирования",
                "Отдел формирования первичной документации",
                "Сектор планирования, формирования отчетности и анализа доходных поступлений"
            ],
            "Служба инвестиций и реализации проектов": [
                "Отдел планирования и реализации инвестиционной деятельности",
                "Отдел строительства и реконструкции"
            ],
            "Служба управления персоналом": [
                "Отдел подготовки кадров",
                "Отдел руководящих кадров",
                "Отдел жилищно-корпоративной политики и социального развития",
                "Отдел управления трудовыми ресурсами и организационной структурой"
            ],
            "Административно-хозяйственный отдел": [],
            "Отдел координации поставок материально-технических ресурсов": [],
            "Отдел охраны труда, промышленной безопасности и экологического контроля": [],
            "Отдел договорной и закупочной деятельности": [],
            "Отдел рельсосварочного производства": [],
            "Отдел безопасности движения поездов и управления качеством ремонта пути": [],
            "Отдел управления делами": [],
            "Сектор координации работ по безопасности": []
        },
        "Орган управления Московской дирекции по ремонту пути": {
            "Производственный отдел": [],
            "Технический отдел": [],
            "Группа охраны труда, промышленной, пожарной безопасности и экологического контроля": [],
            "Оперативный отдел": [],
            "Сектор механизации": [],
            "Сектор комплектации": [],
            "Отдел экономики и финансов": [],
            "Группа финансовых расчетов": [],
            "Сектор управления персоналом": []
        },
        "Опытная путевая машинная станция № 103": {
            "Производственно-технический отдел": [],
            "Сектор экономики и финансов": [],
            "Сектор управления персоналом": [],
            "Группа охраны труда": [],
            "Сектор новых технологий": [],
            "Оперативная группа": [],
            "Производственная база": [
                "Участок сборки новой рельсошпальной решетки",
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок складирования балласта"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2 (путеразборочных и путеукладочных поездов)": [
                "Поезд № 1",
                "Поезд № 2"
            ],
            "Участок эксплуатации и обслуживания путевых машин": [],
            "Участок эксплуатации и обслуживания автомобильной и дорожно-строительной техники": [],
            "Участок ремонта и обслуживания машин": []
        },
        "Опытная путевая машинная станция № 68": {
            "Производственно-технический отдел": [],
            "Сектор экономики и финансов": [],
            "Отдел строительства и реконструкции": [],
            "Производственная база": [
                "Участок сборки стрелочных переводов",
                "Участок складирования балласта"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3",
                "Ремонтно-путевой участок № 5"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2",
                "Поезд № 4"
            ],
            "Путевая колонна № 3 (по стрелочным переводам)": []
        },
        "Опытная путевая машинная станция № 99": {
            "Производственно-технический отдел": [],
            "Производственная база": [
                "Участок сборки новой рельсошпальной решетки",
                "Участок складирования балласта"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2"
            ],
            "Участок эксплуатации и обслуживания путевых машин № 1": [],
            "Участок эксплуатации и обслуживания путевых машин № 2": [],
            "Участок передвижных рельсосварочных машин": [],
            "Участок транспортировки рельсов и рельсовых плетей": []
        },
        "Путевая машинная станция № 101": {
            "Производственно-технический отдел": [],
            "Производственная база": [
                "Участок складирования балласта",
                "Участок ремонта и обслуживания машин"
            ]
        },
        "Путевая машинная станция № 104": {
            "Производственно-технический отдел": [],
            "Производственная база": [
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок складирования балласта"
            ],
            "Производственная база № 2 (ст. Плеханово)": [
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок текущего содержания базы"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2"
            ]
        },
        "Путевая машинная станция № 12": {
            "Производственно-технический отдел": [],
            "Производственная база": [
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок складирования балласта",
                "Участок сборки стрелочных переводов"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2"
            ],
            "Путевая колонна № 3 (по стрелочным переводам)": []
        },
        "Путевая машинная станция № 55": {
            "Производственно-технический отдел": [],
            "Производственная база": [
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок текущего содержания базы"
            ],
            "Путевая колонна № 1": [
                "Путеразборочный поезд",
                "Путеукладочный поезд",
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2"
            ],
            "Путевая колонна № 2 (по стрелочным переводам)": [],
            "Участок передвижных рельсосварочных машин": [],
            "Участок транспортировки рельсов": []
        },
        "Путевая машинная станция № 58": {
            "Производственно-технический отдел": [],
            "Отдел экономики и финансов": [],
            "Производственная база": [
                "Участок сборки стрелочных переводов",
                "Участок складирования балласта"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2"
            ],
            "Путевая колонна № 3 (по стрелочным переводам)": [],
            "Участок сварки стыков алюминотермитным способом": []
        },
        "Путевая машинная станция № 96": {
            "Производственно-технический отдел": [],
            "Производственная база № 1 (ст. Вязьма-Брянская)": [
                "Участок подготовки инвентарных рельсов",
                "Участок сборки новой рельсошпальной решетки",
                "Участок складирования балласта"
            ],
            "Производственная база № 2 (ст. Петелино)": [
                "Участок сборки стрелочных переводов",
                "Участок складирования балласта"
            ],
            "Производственная база № 3 (ст. Смоленск)": [
                "Участок демонтажа и сборки старогодной рельсошпальной решетки",
                "Участок текущего содержания базы",
                "Участок переработки резинотехнических изделий"
            ],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 1",
                "Ремонтно-путевой участок № 2",
                "Ремонтно-путевой участок № 3"
            ],
            "Путевая колонна № 2": [
                "Поезд № 1",
                "Поезд № 2"
            ],
            "Путевая колонна № 3 (по стрелочным переводам)": [],
            "Участок по приведению полосы отвода к проектным параметрам": []
        },
        "Путевая машинная станция № 97": {
            "Производственно-технический отдел": [],
            "Путевая колонна № 1": [
                "Ремонтно-путевой участок № 3"
            ],
            "Участок эксплуатации и обслуживания автомобильной и дорожно-строительной техники": [],
            "Участок ремонта и обслуживания машин": []
        }
        },
    "Центральная дирекция по тепловодоснабжению": {
        "Орган управления": {
            "Служба эксплуатации": [
                "Отдел координации поставок материально-технических ресурсов",
                "Отдел эксплуатации объектов водоснабжения и водоотведения",
                "Отдел эксплуатации объектов теплоснабжения"
            ],
            "Производственно-техническая служба": [
                "Отдел цифровизации и инновационной деятельности",
                "Группа инновационного развития",
                "Производственно-технический отдел",
                "Сектор экологического контроля"
            ],
            "Служба заказчика": [
                "Отдел реализации",
                "Отдел подготовки строительства",
                "Отдел биржевых закупок"
            ],
            "Отдел охраны труда и промышленной безопасности": [],
            "Отдел по управлению персоналом и социальным вопросам": [],
            "Отдел управления трудовыми ресурсами и организационной структурой": [],
            "Сектор управления имуществом": [],
            "Служба экономики и финансов": [
                "Отдел экономики",
                "Отдел финансового контроллинга и платежных балансов",
                "Отдел оценки эффективности проектов и тарифообразования"
            ],
            "Отдел договорной работы": [],
            "Отдел по претензионной работе": [],
            "Сектор безопасности": [],
            "Отдел организационно-документационного обеспечения": []
        },
        "Московская дирекция по тепловодоснабжению": {
            "Отдел эксплуатации объектов теплоснабжения": [],
            "Отдел эксплуатации объектов водоснабжения и водоотведения": [],
            "Сектор охраны труда, промышленной безопасности и экологического контроля": [],
            "Сектор управления персоналом": [],
            "Отдел договорной и претензионной работы": [],
            "Отдел экономики и финансов": [],
            "Группа финансовых расчетов": [],
            "Производственно-технический отдел": []
        },
        "Московско-Курский территориальный участок": {
            "Московский участок водоснабжения и водоотведения": [],
            "Участок аварийно-восстановительных работ (Московский узел)": [],
            "Серпуховской участок водоснабжения и водоотведения": [],
            "Орехово-Зуевский участок водоснабжения и водоотведения": [],
            "Александровский участок водоснабжения и водоотведения": [],
            "Участок эксплуатации котельных": [
                "Котельная станции Куровская",
                "Котельная станции Александров",
                "Котельная Московского энергомеханического завода",
                "Котельная станции Орехово-Зуево (Транспортная)",
                "Котельная станции Куровская",
                "Котельная станции Пушкино",
                "Котельная Московского энергомеханического завода",
                "Котельная станции Лихоборы",
                "Котельная ст. Лосиноостровская"
            ]
        },
        "Московско-Рязанский территориальный участок": {
            "Воскресенский участок тепловодоснабжения": [],
            "Эксплуатационный участок (станция Рязань)": [],
            "Котельная станции Рыбное": [],
            "Котельная станции Рязань": [],
            "Ремонтный участок (станций Сасово, Рязань, Рыбное-Голутвин)": [],
            "Котельная станции Голутвин": [],
            "Ряжский участок водоснабжения и водоотведения": [],
            "Участок тепловодоснабжения и водоотведения (ст. Кашира - ст. Ожерелье)": [],
            "Котельная станции Ожерелье (ул. Донбасская)": [],
            "Котельная станции Рязань-1": [],
            "Котельная ст. Рязань, Михайловское ш. д. 41": [],
            "Котельная ст. Шилово": [],
            "Котельная станции Сасово": []
        },
        "Московско-Смоленский территориальный участок": {
            "Рижско-Савеловский участок водоснабжения и водоотведения": [],
            "Калужский участок водоснабжения и водоотведения": [],
            "Участок эксплуатации котельных": [
                "Котельная пос. Железнодорожников",
                "Котельная г. Москва, ул. Нижняя"
            ],
            "Бекасовский участок тепловодоснабжения и водоотведения": []
        },
        "Тульский территориальный участок": {
            "Тульско-Узловский участок водоснабжения и водоотведения": [],
            "Участок эксплуатации котельных": [
                "Котельная станции Тула-1",
                "Котельная станции Узловая",
                "Котельная станции Новомосковск"
            ]
        },
        "Смоленский территориальный участок": {
            "Вяземский участок водоснабжения и водоотведения": [],
            "Участок производства по обслуживанию и ремонту котельных и тепловых сетей (Смоленск, Вязьма)": [],
            "Котельная станции Вязьма (ул. Поворотная)": [],
            "Котельная станции Смоленск ТЧР-48": []
        },
        "Брянский территориальный участок": {
            "Участок водоснабжения и водоотведения": [],
            "Станция Унеча": [],
            "Участок эксплуатации котельных": [
                "Участок котельных по ст. Брянск",
                "Котельная ст. Брянск-Льговский (ул. Дзержинского 42)",
                "Котельная Брянск-Восточный",
                "Котельная станции Сухиничи",
                "Котельная станции Унеча",
                "Котельная ст. Брянск-Льговский (ул. Московская, 56)",
                "Котельная станции Сухиничи ТЧР-47",
                "Котельная станции Сухиничи (Больница)",
                "Котельная станции Новозыбков",
                "Котельная г. Брянск, 1-я Аллея, 4",
                "Котельная г. Брянск, 2-я Аллея, д. 27",
                "Котельная ст. Сухиничи-Главные, ПЧ-48",
                "Котельная Брянск (ПМС-99)",
                "Котельная ст. Почеп",
                "Котельная ст. Комаричи"
            ],
            "Участок эксплуатации котельных и тепловых сетей": [
                "Котельная ст. Курбакинская",
                "Котельная г. Орел, ул. 3-я Курская, д. 56",
                "Котельная ст. Льгов-2, ПМС-338, ул. Красная",
                "Котельная ст. Верховье (вокзал)",
                "Котельная ст. Мценск"
            ]
        }
        },
    "Центральная дирекция инфраструктуры": {
        "Орган управления": {
            "Руководство": [],
            "Управление пути и сооружений": [
                "Группа информационного обеспечения",
                "Отдел оценки технического состояния инженерных сооружений",
                "Отдел земляного полотна",
                "Отдел ремонта инженерных сооружений",
                "Отдел управления качеством и внедрения новых технологий",
                "Отдел сварки, наплавки и шлифовки рельсов",
                "Сектор бесстыкового пути",
                "Отдел безопасности движения на переездах",
                "Отдел восстановления основных средств"
            ],
            "Управление автоматики и телемеханики": [
                "Отдел организации технической эксплуатации систем ЖАТ",
                "Отдел производства и комплектации"
            ],
            "Управление вагонного хозяйства": [
                "Технический отдел",
                "Отдел эксплуатации",
                "Отдел ремонта подвижного состава"
            ],
            "Управление механизации": [
                "Отдел эксплуатации специального подвижного состава",
                "Технический отдел"
            ],
            "Служба безопасности движения": [
                "Информационно-аналитический отдел",
                "Отдел контроля и аудита"
            ],
            "Техническая служба": [
                "Технический отдел",
                "Отдел перспективного развития"
            ],
            "Служба охраны труда": [
                "Отдел охраны труда",
                "Отдел промышленной и пожарной безопасности"
            ],
            "Служба управления персоналом": [
                "Отдел по подбору кадров",
                "Отдел развития и обучения персонала"
            ],
            "Юридическая служба": [],
            "Служба заказчика": [
                "Отдел подготовки строительства",
                "Производственный отдел"
            ],
            "Центр управления содержанием инфраструктуры": [
                "Аналитический отдел",
                "Отдел диспетчерского управления",
                "Технологический отдел"
            ]
        },
        "Московская дирекция инфраструктуры": {
            "Служба пути": [
                "Отдел эксплуатации",
                "Отдел инженерных сооружений",
                "Технический отдел"
            ],
            "Служба вагонного хозяйства": [
                "Отдел эксплуатации грузовых вагонов",
                "Технический отдел"
            ],
            "Служба автоматики и телемеханики": [
                "Отдел эксплуатации средств ЖАТ",
                "Технический сектор"
            ],
            "Служба механизации": [
                "Отдел эксплуатации",
                "Производственно-технический отдел"
            ],
            "Служба управления персоналом": [
                "Отдел рабочих кадров",
                "Отдел развития и обучения"
            ],
            "Центр управления содержанием инфраструктуры": [
                "Аналитический отдел",
                "Отдел диспетчерского управления",
                "Технологический отдел"
            ],
            "Московско-Курский отдел инфраструктуры": [],
            "Московско-Рязанский отдел инфраструктуры": [],
            "Московско-Смоленский отдел инфраструктуры": [],
            "Тульский отдел инфраструктуры": [],
            "Орловско-Курский отдел инфраструктуры": [],
            "Смоленский отдел инфраструктуры": [],
            "Брянский отдел инфраструктуры": []
        },
        "Дирекция по эксплуатации путевых машин": {
            "Московская дирекция по эксплуатации путевых машин": [
                "Сектор безопасности движения",
                "Производственно-технический отдел",
                "Отдел экономики и финансов"
            ],
            "Брянская механизированная дистанция инфраструктуры": [
                "Производственно-технический отдел",
                "Отдел эксплуатации"
            ],
            "Вяземская механизированная дистанция инфраструктуры": [
                "Производственно-технический отдел",
                "Отдел эксплуатации"
            ],
            "Рязанская механизированная дистанция инфраструктуры": [],
            "Фаянсовская механизированная дистанция инфраструктуры": []
        },
        "Дирекция диагностики и мониторинга инфраструктуры": {
            "Московский центр диагностики и мониторинга": [
                "Отдел эксплуатации диагностических средств",
                "Технический отдел",
                "Отдел неразрушающего контроля"
            ]
        },
        "Эксплуатационное вагонное депо Орехово-Зуево (I группа)": [],
        "Эксплуатационное вагонное депо Бирюлево (I группа)": [],
        "Эксплуатационное вагонное депо Бекасово (I группа)": [],
        "Эксплуатационное вагонное депо Тула (I группа)": [],
        "Эксплуатационное вагонное депо Рязань (I группа)": [],
        "Эксплуатационное вагонное депо Брянск (I группа)": [],
        "Московско-Курская дистанция пути (I группа)": [],
        "Московско-Горьковская дистанция пути (I группа)": [],
        "Московско-Рязанская дистанция пути (I группа)": [],
        "Голутвинская дистанция пути (I группа)": [],
        "Куровская дистанция пути (I группа)": [],
        "Московско-Ярославская дистанция пути (I группа)": [],
        "Александровская дистанция пути (I группа)": [],
        "Московско-Рижская дистанция пути (I группа)": [],
        "Московско-Смоленская дистанция пути (I группа)": [],
        "Бекасовская дистанция пути (I группа)": [],
        "Московско-Киевская дистанция пути (I группа)": [],
        "Тульская дистанция пути (I группа)": [],
        "Орловская дистанция пути (I группа)": [],
        "Курская дистанция пути (I группа)": [],
        "Жилевская дистанция пути (I группа)": [],
        "Каширская дистанция пути (I группа)": [],
        "Узловская дистанция пути (I группа)": [],
        "Рязанская дистанция пути (I группа)": [],
        "Сасовская дистанция пути (I группа)": [],
        "Вяземская дистанция пути (I группа)": [],
        "Сафоновская дистанция пути (I группа)": [],
        "Смоленская дистанция пути (I группа)": [],
        "Калужская дистанция пути (I группа)": [],
        "Брянская дистанция пути (I группа)": [],
        "Брянск-Льговская дистанция пути (I группа)": [],
        "Унечская дистанция пути (II группа)": [],
        "Московская дистанция инженерных сооружений (I группа)": [],
        "Тульская дистанция инженерных сооружений (II группа)": [],
        "Люблинская дистанция СЦБ (I группа)": [],
        "Железнодорожная дистанция СЦБ (I группа)": [],
        "Бекасовская дистанция СЦБ (I группа)": [],
        "Перовская дистанция СЦБ (I группа)": [],
        "Голутвинская дистанция СЦБ (I группа)": [],
        "Московско-Ярославская дистанция СЦБ (I группа)": [],
        "Рижско-Савеловская дистанция СЦБ (I группа)": [],
        "Московско-Смоленская дистанция СЦБ (I группа)": [],
        "Тульская дистанция СЦБ (I группа)": [],
        "Орловско-Курская дистанция СЦБ (I группа)": [],
        "Курская дистанция СЦБ (II группа)": [],
        "Каширская дистанция СЦБ (I группа)": [],
        "Узловская дистанция СЦБ (I группа)": [],
        "Смоленская дистанция СЦБ (I группа)": [],
        "Вяземская дистанция СЦБ (I группа)": [],
        "Калужская дистанция СЦБ (II группа)": [],
        "Брянск-Сухиничская дистанция СЦБ (I группа)": [],
        "Брянск-Унечская дистанция СЦБ (I группа)": [],
        "Московско-Окружная дистанция инфраструктуры (I группа)": [],
        "Льговская дистанция инфраструктуры (I группа)": [],
        "Плехановская дистанция инфраструктуры (III группа)": [],
        "Фаянсовская дистанция инфраструктуры (III группа)": []
        },
    "Трансинформ": {
        "Главный вычислительный центр": {
            "Орган управления": [
                "Отдел экономики и организационно-штатной работы",
                "Отдел финансов",
                "Отдел управления персоналом",
                "Отдел организации производственных процессов",
                "Технический отдел",
                "Отдел маркетинга и развития бизнеса"
            ],
            "Процессинг": [
                "Служба развития процессного управления",
                "Служба организации технологического сопровождения",
                "Служба проектной координации"
            ],
            "Эксплуатационно-технический отдел": []
        },
        "Московский информационно-вычислительный центр": [
            "Отдел по управлению персоналом",
            "Отдел экономики и финансов",
            "Технический отдел",
            "Производственный отдел",
            "Эксплуатационно-технический отдел"
        ]
    },
    "Центральная станция связи": {
        "Орган управления": [
            "Служба эксплуатации",
            "Инженерно-техническая служба",
            "Служба экономики",
            "Служба финансов",
            "Служба управления персоналом",
            "Отдел управления делами"
        ],
        "Центр управления технологической сетью связи": [
            "Лаборатория обработки информации",
            "Центр управления телекоммуникационными ресурсами"
        ],
        "Цех телеграфа": [],
        "Цех обслуживания аппарата управления": []
    },
    "Московская дирекция связи": {
        "Орган управления": [
            "Отдел эксплуатации электросвязи",
            "Технический отдел",
            "Отдел экономики и финансов",
            "Отдел абонентского обслуживания"
        ],
        "Московско-Рязанский региональный центр связи": [],
        "Московско-Курский региональный центр связи": [],
        "Московско-Смоленский региональный центр связи": [],
        "Тульский региональный центр связи": [],
        "Рязанский региональный центр связи": [],
        "Орловско-Курский региональный центр связи": [],
        "Смоленский региональный центр связи": [],
        "Брянский региональный центр связи": []
    }
};